loadtest.yaml
config:
  target: 'http://67.202.9.244'
  
  phases:
    - duration: 60
      arrivalRate: 2
  defaults:
    headers:
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      Accept-Encoding: gzip, deflate, br
      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/119.0.0.0 Safari/537.36
      Content-Type: application/json

scenarios:
  - flow:
      - get:
          url: '/customers?customerId=125'