loadtest.yaml
config:

  plugins:
    publish-metrics:
    
        - type: cloudwatch
          region: us-east-1

  http: 
        extendedMetrics: true
  target: 'https://dummyapi.io'
  
  phases:

    - name: PerfLoadTest
      duration: 60
      arrivalCount: 2
  defaults:
    headers:
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      Accept-Encoding: gzip, deflate, br
      User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/121.0.0.0 Safari/537.36
      Upgrade-Insecure-Requests: 1
      Connection: keep-alive
      Cache-Control: no-cache

scenarios:
  - flow:
      - get:
          url: '/sign-in'