loadtest.yaml
config:
  target: 'http://67.202.9.244'
  
  phases:

    - name: Perfloadtest
      duration: 30
      arrivalRate: 2
  defaults:
    headers:
      Accept: text/html,application/xhtml+xml,application/xml;q=0.9,image/avif,image/webp,image/apng,*/*;q=0.8,application/signed-exchange;v=b3;q=0.7
      Accept-Encoding: gzip, deflate, br
      User-Agent: PostmanRuntime/7.34.0
      Host: 67.202.9.244
      Upgrade-Insecure-Requests: 1

scenarios:
  - flow:
      - get:
          url: '/customers?customerId=125'